Dataframes con Panda

In [2]:
import pandas as pd

In [3]:
data = {'Primer nombre': ['Valentina','Daniel','Carlos'],
        'Segundo nombre':['Francisco','Juan','Felipe'],
        'Estatura_m':[1.8,1.55,1.70],
        'Estudia':['No','Si','Si']}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

  Primer nombre Segundo nombre  Estatura_m Estudia
0     Valentina      Francisco        1.80      No
1        Daniel           Juan        1.55      Si
2        Carlos         Felipe        1.70      Si

In [6]:
 df['Estatura_m']

0    1.80
1    1.55
2    1.70
Name: Estatura_m, dtype: float64

In [7]:
df['Estatura_in']=df['Estatura_m']*39.3701

In [8]:
df

  Primer nombre Segundo nombre  Estatura_m Estudia  Estatura_in
0     Valentina      Francisco        1.80      No    70.866180
1        Daniel           Juan        1.55      Si    61.023655
2        Carlos         Felipe        1.70      Si    66.929170

In [9]:
df.dtypes

Primer nombre      object
Segundo nombre     object
Estatura_m        float64
Estudia            object
Estatura_in       float64
dtype: object

In [10]:
'''convertir columna estudia en categoria'''
df['Estudiar'] = df['Estudia'].astype('category')

In [11]:
df

  Primer nombre Segundo nombre  Estatura_m Estudia  Estatura_in Estudiar
0     Valentina      Francisco        1.80      No    70.866180       No
1        Daniel           Juan        1.55      Si    61.023655       Si
2        Carlos         Felipe        1.70      Si    66.929170       Si

In [12]:
df.dtypes

Primer nombre       object
Segundo nombre      object
Estatura_m         float64
Estudia             object
Estatura_in        float64
Estudiar          category
dtype: object

In [13]:
df['Apellido'] = ['SÃ¡nchez','Rodriguez','Villalba']

In [14]:
df

,Primer nombre,Segundo nombre,Estatura_m,Estudia,Estatura_in,Estudiar,Apellido
0,Valentina,Francisco,1.80,No,70.866180,No,SÃ¡nchez
1,Daniel,Juan,1.55,Si,61.023655,Si,Rodriguez
2,Carlos,Felipe,1.70,Si,66.929170,Si,Villalba

In [15]:
df.shape

(3, 7)

In [16]:
df.pop(5)

KeyError: 5

In [17]:
df.pop('Estudiar')

0    No
1    Si
2    Si
Name: Estudiar, dtype: category
Categories (2, object): [No, Si]

In [18]:
df

  Primer nombre Segundo nombre  Estatura_m Estudia  Estatura_in   Apellido
0     Valentina      Francisco        1.80      No    70.866180    SÃ¡nchez
1        Daniel           Juan        1.55      Si    61.023655  Rodriguez
2        Carlos         Felipe        1.70      Si    66.929170   Villalba

In [27]:
df['Codigo']=['L1','G1','P1']

In [20]:
df

,Primer nombre,Segundo nombre,Estatura_m,Estudia,Estatura_in,Apellido,Codigo
0,Valentina,Francisco,1.80,No,70.866180,SÃ¡nchez,L1
1,Daniel,Juan,1.55,Si,61.023655,Rodriguez,G1
2,Carlos,Felipe,1.70,Si,66.929170,Villalba,P1

In [23]:
#Poner la columna al principio
df.set_index('Codigo',inplace = True)

KeyError: 'Codigo'

In [22]:
df

,Primer nombre,Segundo nombre,Estatura_m,Estudia,Estatura_in,Apellido
Codigo,,,,,,
L1,Valentina,Francisco,1.80,No,70.866180,SÃ¡nchez
G1,Daniel,Juan,1.55,Si,61.023655,Rodriguez
P1,Carlos,Felipe,1.70,Si,66.929170,Villalba

In [24]:
df

,Primer nombre,Segundo nombre,Estatura_m,Estudia,Estatura_in,Apellido
Codigo,,,,,,
L1,Valentina,Francisco,1.80,No,70.866180,SÃ¡nchez
G1,Daniel,Juan,1.55,Si,61.023655,Rodriguez
P1,Carlos,Felipe,1.70,Si,66.929170,Villalba

In [25]:
df.shape

(3, 6)

In [26]:
df.set_index('Apellido',2)

          Primer nombre Segundo nombre  Estatura_m Estudia  Estatura_in
Apellido
SÃ¡nchez       Valentina      Francisco        1.80      No    70.866180
Rodriguez        Daniel           Juan        1.55      Si    61.023655
Villalba         Carlos         Felipe        1.70      Si    66.929170

In [28]:
df

,Primer nombre,Segundo nombre,Estatura_m,Estudia,Estatura_in,Apellido,Codigo
Codigo,,,,,,,
L1,Valentina,Francisco,1.80,No,70.866180,SÃ¡nchez,L1
G1,Daniel,Juan,1.55,Si,61.023655,Rodriguez,G1
P1,Carlos,Felipe,1.70,Si,66.929170,Villalba,P1

In [29]:
df.pop('Codigo')

Codigo
L1    L1
G1    G1
P1    P1
Name: Codigo, dtype: object

In [30]:
df

,Primer nombre,Segundo nombre,Estatura_m,Estudia,Estatura_in,Apellido
Codigo,,,,,,
L1,Valentina,Francisco,1.80,No,70.866180,SÃ¡nchez
G1,Daniel,Juan,1.55,Si,61.023655,Rodriguez
P1,Carlos,Felipe,1.70,Si,66.929170,Villalba

TypeError: 'Index' object is not callable

In [32]:
df.drop('Apellido',2)

ValueError: No axis named 2 for object type <class 'pandas.core.frame.DataFrame'>

In [35]:
#Reorganizar como uno quiere que sea el orden
df = df[['Primer nombre', 'Segundo nombre', 'Apellido', 'Estatura_m','Estatura_in', 'Estudia']]

In [34]:
df

,Primer nombre,Segundo nombre,Apellido,Estatura_m,Estatura_in,Estudia
Codigo,,,,,,
L1,Valentina,Francisco,SÃ¡nchez,1.80,70.866180,No
G1,Daniel,Juan,Rodriguez,1.55,61.023655,Si
P1,Carlos,Felipe,Villalba,1.70,66.929170,Si

In [36]:
df.to_excel('Datos.xlsx',sheet_name='Datos')
df.to_csv('Datos.csv')

In [37]:
df.iloc[1]

Primer nombre        Daniel
Segundo nombre         Juan
Apellido          Rodriguez
Estatura_m             1.55
Estatura_in         61.0237
Estudia                  Si
Name: G1, dtype: object

In [38]:
df.loc['G1']

Primer nombre        Daniel
Segundo nombre         Juan
Apellido          Rodriguez
Estatura_m             1.55
Estatura_in         61.0237
Estudia                  Si
Name: G1, dtype: object

In [39]:
df.loc['G1','Estudia']

'Si'

In [40]:
df.sort_index()

,Primer nombre,Segundo nombre,Apellido,Estatura_m,Estatura_in,Estudia
Codigo,,,,,,
G1,Daniel,Juan,Rodriguez,1.55,61.023655,Si
L1,Valentina,Francisco,SÃ¡nchez,1.80,70.866180,No
P1,Carlos,Felipe,Villalba,1.70,66.929170,Si

In [41]:
df.sort_index(ascending=False)

,Primer nombre,Segundo nombre,Apellido,Estatura_m,Estatura_in,Estudia
Codigo,,,,,,
P1,Carlos,Felipe,Villalba,1.70,66.929170,Si
L1,Valentina,Francisco,SÃ¡nchez,1.80,70.866180,No
G1,Daniel,Juan,Rodriguez,1.55,61.023655,Si

In [42]:
df.sort_index(by = ['Estatura_m'], ascending=False)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

,Primer nombre,Segundo nombre,Apellido,Estatura_m,Estatura_in,Estudia
Codigo,,,,,,
L1,Valentina,Francisco,SÃ¡nchez,1.80,70.866180,No
P1,Carlos,Felipe,Villalba,1.70,66.929170,Si
G1,Daniel,Juan,Rodriguez,1.55,61.023655,Si

In [44]:
filtro = (df['Estudia'] == 'Si')
df[filtro]

,Primer nombre,Segundo nombre,Apellido,Estatura_m,Estatura_in,Estudia
Codigo,,,,,,
G1,Daniel,Juan,Rodriguez,1.55,61.023655,Si
P1,Carlos,Felipe,Villalba,1.70,66.929170,Si

In [45]:
filtro = (df['Estudia'] == 'Si')
df[~filtro]

       Primer nombre Segundo nombre Apellido  Estatura_m  Estatura_in Estudia
Codigo
L1         Valentina      Francisco  SÃ¡nchez         1.8     70.86618      No

In [46]:
filtro2 = (df['Estudia']== 'Si') & (df['Estatura_m'] >= 1.70)

In [47]:
filtro2

Codigo
L1    False
G1    False
P1     True
dtype: bool

In [48]:
df[filtro2]

       Primer nombre Segundo nombre  Apellido  Estatura_m  Estatura_in Estudia
Codigo
P1            Carlos         Felipe  Villalba         1.7     66.92917      Si